# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bat' # Used for spatie/visit
brew 'chezmoi'
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'tig'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'node'

# Apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-inconsolata'

# Mac App Store
mas 'AffinityDesigner', id: 824171161
mas 'AffinityPhoto', id: 824183456
mas 'Airmail3', id: 918858936
mas 'AppCleaner', id: 1013897218
mas 'Bear', id: 1091189122
mas 'Divvy', id: 413857545
mas 'Fantastical2', id: 975937182
mas 'Gifox', id: 1082624744
mas 'Kaleidoscope', id: 587512244
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Paprika3', id: 1303222628
mas 'Pixelmator', id: 407963104
mas 'Pocket', id: 568494494
mas 'Resizer', id: 411277085
mas 'Things3', id: 904280696
mas 'Trello', id: 1278508951
mas 'TheUnarchiver', id: 425424353
