###############################################################
#  ~/Brewfile - Software Installs for MacOS                   #
#                                                             #
#  List of packages to be installed / updated via Homebrew    #
#  Usage, run: $ brew bundle install                          #
#  See brew docs for more info: https://docs.brew.sh/Manpage  #
#                                                             #
#  License: MIT © Mina Markham 2024 <https://mina.codes>      #
###############################################################

# Options
cask_args appdir: '~/Applications'

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"

###############################################################
# Command Line                                                #
###############################################################

brew "awscli"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "eza"
brew "fizz"
brew "folly"
brew "fswatch"
brew "git-lfs"
brew "git"
brew "httpie"
brew "hub"
brew "jfrog-cli"
brew "jq"
brew "mas"
brew "micro"
brew "neofetch"
brew "openssl@3"
brew "python@3.10"
brew "python@3.11"
brew "rsync"
brew "starship"
brew "tcptraceroute"
brew "tig"
brew "wangle"
brew "watchman"
brew "wget"
brew "zoxide"

###############################################################
# Desktop Applications                                        #
###############################################################
cask "aerial"
cask "bartender"
cask "httpie"
cask "sequel-ace"
cask "session-manager-plugin"
cask "warp"

mas 'CapCut - Video Editor', id:1500855883
mas 'Filmora: Movie & Video Editor', id:1516822341
mas "Bear", id: 1091189122
mas "ColorSlurp", id: 1287239339
mas "com.myc.taskapp", id: 1502903102
mas "Friendly Streaming", id: 553245401
mas "Gemini 2", id: 1090488118
mas "Hidden Bar", id: 1452453066
mas "Magnet", id: 441258766
mas "Mela", id: 1568924476
mas "Pages", id: 409201541
mas "Screen Recorder by Omi", id: 1592987853
mas "Things", id: 904280696
mas "TinyNotepad", id: 1449415412
mas "Todoist", id: 585829637
mas "Twingate", id: 1501592214

###############################################################
# Visual Studio Code Extensions                               #
###############################################################
vscode "aaron-bond.better-comments"
vscode "adam-bender.commit-message-editor"
vscode "alexcvzz.vscode-sqlite"
vscode "anseki.vscode-color"
vscode "bernardop.working-sets"
vscode "bierner.color-info"
vscode "bierner.emojisense"
vscode "burkeholland.simple-react-snippets"
vscode "cduruk.thrift"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "dbaeumer.vscode-eslint"
vscode "dionmunk.vscode-notes"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "fayras.simple-new-file"
vscode "folke.vscode-monorepo-workspace"
vscode "fooxly.workspace"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "ginfuru.better-nunjucks"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jannisx11.batch-rename-extension"
vscode "jock.svg"
vscode "jrebocho.vscode-random"
vscode "kruemelkatze.vscode-dashboard"
vscode "lordbrom.highlight-duplicates"
vscode "miclo.sort-typescript-imports"
vscode "mike-co.import-sorter"
vscode "minamarkham.yonce-theme"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pranayagarwal.vscode-hack"
vscode "randomfractalsinc.snippets-viewer"
vscode "ronnidc.nunjucks"
vscode "samverschueren.final-newline"
vscode "shardulm94.trailing-spaces"
vscode "sirtori.indenticator"
vscode "slack-technologies.vscode-remote-envs"
vscode "slack-technologies.vscode-slack-webapp"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tahabasri.snippets"
vscode "talhabalaj.actual-font-changer"
vscode "tamasfe.even-better-toml"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "urbantrout.refactor-css"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vivaxy.vscode-conventional-commits"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "zhucy.project-tree"
