###############################################################
#  ~/Brewfile - Software Installs for MacOS                   #
#                                                             #
#  List of packages to be installed / updated via Homebrew    #
#  Usage, run: $ brew bundle --global --file $HOME/.Brewfile  #
#  See brew docs for more info: https://docs.brew.sh/Manpage  #
#                                                             #
#  License: MIT © Mina Markham 2024 <https://mina.codes>      #
###############################################################

# Options
cask_args appdir: '~/Applications'

# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'

###############################################################
# Command Line                                                #
###############################################################

# CLI Essentials
brew 'git'          # Version control
brew 'starship'

# CLI Basics
brew 'eza'          # Listing files with info (better ls)
brew 'micro'
brew 'zoxide'       # Auto-learning navigation (better cd)

# CLI Monitoring and Performance Apps

# CLI Productivity Apps
brew 'chezmoi'
brew 'mackup'
brew 'mas'
brew 'fileicon'

# CLI Development Suits
brew 'httpie'       # HTTP / API testing testing client

# CLI External Sercvices

# CLI Fun
brew 'neofetch'     # Show system data and ditstro info

# Development Langs, Compilers, Package Managers and SDKs
brew 'node'           # Node.js
brew 'nvm'            # Switching node versions
brew 'python'         # Python interpreter

# DevOps

# Development Utils
brew 'gh'             # Interact with GitHub PRs, issues, repos
brew 'hub'

# Network and Security Testing

# Security Utilities and Data Encryption

###############################################################
# Desktop Applications                                        #
###############################################################

# Development Apps
cask 'httpie'           # HTTP / API testing testing client
cask 'hyper'            # Better terminal emulator
cask 'sequel-ace'
cask 'visual-studio-code' # Code editor
cask 'warp'             # Better terminal emulator

# Creativity
cask 'canva'
cask 'figma'
cask 'fontbase'

mas 'Filmora: Movie & Video Editor', id:1516822341
mas 'CapCut - Video Editor', id:1500855883
mas 'ColorSlurp', id:1287239339

# Media
mas 'Friendly Streaming Browser', id:553245401
cask 'plex'
cask 'spotify' # Propietary music streaming

# Personal Applications
cask '1password'      # Password manager (proprietary)
cask 'copilot'
cask 'discord'
cask 'dropbox'
cask 'imageoptim'
cask 'local'
cask 'quip'
cask 'slack'

mas 'Bear Markdown Notes', id:1091189122
mas 'Screen Recorder by Omi', id:1592987853
mas 'Twingate', id:1501592214

# Browsers
cask 'google-chrome'

# Fonts
cask 'font-caskaydia-cove-nerd-font'
cask 'font-monaspace'
cask 'font-monofur-nerd-font'                 # https://www.programmingfonts.org/#monofur

# Mac OS Quick-Look Plugins

# Mac OS Mods and Improvements
cask 'bartender'
cask 'raycast' # Spotlight alternative
cask 'ubar'

mas 'Hidden Bar', id:1452453066

# Mac OS Utility Apps
cask 'hazel'

mas 'TinyNotepad', id:1449415412

###############################################################
# Visual Studio Code Extensions                               #
###############################################################
vscode 'aaron-bond.better-comments'
vscode 'alefragnani.project-manager'
vscode 'alexcvzz.vscode-sqlite'
vscode 'anseki.vscode-color'
vscode 'bierner.color-info'
vscode 'bierner.emojisense'
vscode 'bobmagicii.dashyeah'
vscode 'burkeholland.simple-react-snippets'
vscode 'cduruk.thrift'
vscode 'christian-kohler.path-intellisense'
vscode 'dbaeumer.vscode-eslint'
vscode 'dionmunk.vscode-notes'
vscode 'dsznajder.es7-react-js-snippets'
vscode 'eamodio.gitlens'
vscode 'esbenp.prettier-vscode'
vscode 'expo.vscode-expo-tools'
vscode 'fayras.simple-new-file'
vscode 'folke.vscode-monorepo-workspace'
vscode 'fooxly.workspace'
vscode 'formulahendry.auto-close-tag'
vscode 'formulahendry.auto-rename-tag'
vscode 'ginfuru.better-nunjucks'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'jannisx11.batch-rename-extension'
vscode 'jrebocho.vscode-random'
vscode 'lordbrom.highlight-duplicates'
vscode 'minamarkham.yonce-theme'
vscode 'mrmlnc.vscode-duplicate'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode-remote.remote-wsl'
vscode 'ms-vscode-remote.vscode-remote-extensionpack'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vscode.remote-server'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'naumovs.color-highlight'
vscode 'nhoizey.gremlins'
vscode 'pflannery.vscode-versionlens'
vscode 'pkief.material-icon-theme'
vscode 'pnp.polacode'
vscode 'pranayagarwal.vscode-hack'
vscode 'randomfractalsinc.snippets-viewer'
vscode 'ronnidc.nunjucks'
vscode 'samverschueren.final-newline'
vscode 'shardulm94.trailing-spaces'
vscode 'sirtori.indenticator'
vscode 'slack-technologies.vscode-remote-envs'
vscode 'slack-technologies.vscode-slack-webapp'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'stylelint.vscode-stylelint'
vscode 'tahabasri.snippets'
vscode 'tamasfe.even-better-toml'
vscode 'tombonnike.vscode-status-bar-format-toggle'
vscode 'urbantrout.refactor-css'
vscode 'usernamehw.errorlens'
vscode 'vincaslt.highlight-matching-tag'
vscode 'visualstudioexptteam.intellicode-api-usage-examples'
vscode 'visualstudioexptteam.vscodeintellicode'
vscode 'vitaliymaz.vscode-svg-previewer'
vscode 'wayou.vscode-todo-highlight'
vscode 'xabikos.javascriptsnippets'
# EOF
